# 4.1 - MongoDB

![mongo](images/mongodb.jpeg)

https://docs.mongodb.com/manual/administration/install-community/

https://docs.mongodb.com/compass/current/install/

MongoDB es una base de datos orientada a documentos. Esto quiere decir que en lugar de guardar los datos en registros, guarda los datos en documentos. Estos documentos son almacenados en BSON, que es una representación binaria de JSON.

Una de las diferencias más importantes con respecto a las bases de datos relacionales, es que no es necesario seguir un esquema. Los documentos de una misma colección, concepto similar a una tabla de una base de datos relacional, pueden tener esquemas diferentes.

In [ ]:
%pip install pymongo

In [1]:
from pymongo import MongoClient

In [2]:
cursor = MongoClient()   # no esta escrita la string de conexion

cursor

MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True)

In [3]:
str_conn = 'mongodb://localhost:27017'   # str_con por defecto

cursor = MongoClient(str_conn)

cursor

MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True)

In [4]:
cursor.list_database_names()

['admin', 'comp', 'companies', 'config', 'ironcomes', 'local', 'quizzes']

In [5]:
db = cursor.nueva_db     # crea una nueva base de datos

In [6]:
cursor.list_database_names()

['admin', 'comp', 'companies', 'config', 'ironcomes', 'local', 'quizzes']

In [7]:
colec = db.n_colec    # nueva coleccion

In [8]:
db.list_collection_names()

[]

In [9]:
dictio = {'nombre': 'Pepe', 'edad': 45, '4': [1,2,3,4,5]}


dictio

{'nombre': 'Pepe', 'edad': 45, '4': [1, 2, 3, 4, 5]}

In [11]:
colec.insert_one(dictio)

In [12]:
cursor.list_database_names()

['admin',
 'comp',
 'companies',
 'config',
 'ironcomes',
 'local',
 'nueva_db',
 'quizzes']

In [13]:
db.list_collection_names()

['n_colec']

In [17]:
dictio = {'_id': 3, 'hola': 'hasta luego', 'altura': 0.39, 'que te pashhhahahha': 45}


colec.insert_one(dictio)

In [19]:
# insertar varios

# insert into colec (columnas) values (valores);

json = [{'nombre': 'yo', 'edad': 39},
        {'_id': 90, 'actividad': 'montaña', 'monte': 'jultayu'}]


colec.insert_many(json)

In [22]:
# select * from colec;

colec.find()

In [23]:
list(colec.find())

[{'_id': ObjectId('653a1e9247a460b952558b97'),
  'nombre': 'Pepe',
  'edad': 45,
  '4': [1, 2, 3, 4, 5]},
 {'_id': 0, 'hola': 'hasta luego', 'altura': 0.39, 'que te pashhhahahha': 45},
 {'_id': 1, 'hola': 'hasta luego', 'altura': 0.39, 'que te pashhhahahha': 45},
 {'_id': 3, 'hola': 'hasta luego', 'altura': 0.39, 'que te pashhhahahha': 45},
 {'_id': ObjectId('653a1f5c47a460b952558b98'), 'nombre': 'yo', 'edad': 39},
 {'_id': 90, 'actividad': 'montaña', 'monte': 'jultayu'}]

In [24]:
res = list(colec.find())

In [26]:
res[0]['nombre']

'Pepe'

In [27]:
import pandas as pd

pd.DataFrame(res)

,_id,nombre,edad,4,hola,altura,que te pashhhahahha,actividad,monte
0,653a1e9247a460b952558b97,Pepe,45.0,"[1, 2, 3, 4, 5]",NaN,NaN,NaN,NaN,NaN
1,0,NaN,NaN,NaN,hasta luego,0.39,45.0,NaN,NaN
2,1,NaN,NaN,NaN,hasta luego,0.39,45.0,NaN,NaN
3,3,NaN,NaN,NaN,hasta luego,0.39,45.0,NaN,NaN
4,653a1f5c47a460b952558b98,yo,39.0,NaN,NaN,NaN,NaN,NaN,NaN
5,90,NaN,NaN,NaN,NaN,NaN,NaN,montaña,jultayu

### Queries

In [28]:
# select * from colec;

list(colec.find())

[{'_id': ObjectId('653a1e9247a460b952558b97'),
  'nombre': 'Pepe',
  'edad': 45,
  '4': [1, 2, 3, 4, 5]},
 {'_id': 0, 'hola': 'hasta luego', 'altura': 0.39, 'que te pashhhahahha': 45},
 {'_id': 1, 'hola': 'hasta luego', 'altura': 0.39, 'que te pashhhahahha': 45},
 {'_id': 3, 'hola': 'hasta luego', 'altura': 0.39, 'que te pashhhahahha': 45},
 {'_id': ObjectId('653a1f5c47a460b952558b98'), 'nombre': 'yo', 'edad': 39},
 {'_id': 90, 'actividad': 'montaña', 'monte': 'jultayu'}]

In [29]:
# select * from colec where edad=39;


query = {'edad': 39}


list(colec.find(query))

[{'_id': ObjectId('653a1f5c47a460b952558b98'), 'nombre': 'yo', 'edad': 39}]

In [30]:
# select * from colec where edad>=39;


query = {'edad': {'$gte': 39}}


list(colec.find(query))

[{'_id': ObjectId('653a1e9247a460b952558b97'),
  'nombre': 'Pepe',
  'edad': 45,
  '4': [1, 2, 3, 4, 5]},
 {'_id': ObjectId('653a1f5c47a460b952558b98'), 'nombre': 'yo', 'edad': 39}]

In [31]:
# select * from colec where edad>39;


query = {'edad': {'$gt': 39}}


list(colec.find(query))

[{'_id': ObjectId('653a1e9247a460b952558b97'),
  'nombre': 'Pepe',
  'edad': 45,
  '4': [1, 2, 3, 4, 5]}]

In [32]:
# select * from colec where edad<=39;


query = {'edad': {'$lte': 39}}


list(colec.find(query))

[{'_id': ObjectId('653a1f5c47a460b952558b98'), 'nombre': 'yo', 'edad': 39}]

In [33]:
# select * from colec where edad<39;


query = {'edad': {'$lt': 39}}


list(colec.find(query))

[]

In [35]:
# select * from colec where edad!=39;


query = {'edad': {'$ne': 39}}


list(colec.find(query))

[{'_id': ObjectId('653a1e9247a460b952558b97'),
  'nombre': 'Pepe',
  'edad': 45,
  '4': [1, 2, 3, 4, 5]},
 {'_id': 0, 'hola': 'hasta luego', 'altura': 0.39, 'que te pashhhahahha': 45},
 {'_id': 1, 'hola': 'hasta luego', 'altura': 0.39, 'que te pashhhahahha': 45},
 {'_id': 3, 'hola': 'hasta luego', 'altura': 0.39, 'que te pashhhahahha': 45},
 {'_id': 90, 'actividad': 'montaña', 'monte': 'jultayu'}]

In [36]:
# select * from colec where edad<40 and edad>24;
# select * from colec where edad between (40, 24);


query = {'$and': [{'edad': {'$lt': 40}},
                  {'edad': {'$gt': 24}}
                 ]}

list(colec.find(query))

[{'_id': ObjectId('653a1f5c47a460b952558b98'), 'nombre': 'yo', 'edad': 39}]

In [37]:
# select * from colec where edad<40 or edad>24;


query = {'$or': [{'edad': {'$lt': 40}},
                  {'edad': {'$gt': 24}}
                 ]}

list(colec.find(query))

[{'_id': ObjectId('653a1e9247a460b952558b97'),
  'nombre': 'Pepe',
  'edad': 45,
  '4': [1, 2, 3, 4, 5]},
 {'_id': ObjectId('653a1f5c47a460b952558b98'), 'nombre': 'yo', 'edad': 39}]

In [38]:
pd.DataFrame(list(colec.find(query)))

                        _id nombre  edad                4
0  653a1e9247a460b952558b97   Pepe    45  [1, 2, 3, 4, 5]
1  653a1f5c47a460b952558b98     yo    39              NaN

In [42]:
df = pd.DataFrame(list(colec.find(query)))

df.to_dict(orient='records')

[{'_id': ObjectId('653a1e9247a460b952558b97'),
  'nombre': 'Pepe',
  'edad': 45,
  '4': [1, 2, 3, 4, 5]},
 {'_id': ObjectId('653a1f5c47a460b952558b98'),
  'nombre': 'yo',
  'edad': 39,
  '4': nan}]

In [45]:
n_colec = db.colec2

n_colec.insert_many(df.to_dict(orient='records'))

In [47]:
# select * from colec where edad!=38 limit 2;


query = {'edad': {'$ne': 38}}


list(colec.find(query).limit(1))

[{'_id': ObjectId('653a1e9247a460b952558b97'),
  'nombre': 'Pepe',
  'edad': 45,
  '4': [1, 2, 3, 4, 5]}]

In [50]:
# select * from colec where edad!=38 order by edad desc limit 3;


query = {'edad': {'$ne': 38}}


list(colec.find(query).sort('edad', -1).limit(3))    # -1 = desc , 1 = asc

[{'_id': ObjectId('653a1e9247a460b952558b97'),
  'nombre': 'Pepe',
  'edad': 45,
  '4': [1, 2, 3, 4, 5]},
 {'_id': ObjectId('653a1f5c47a460b952558b98'), 'nombre': 'yo', 'edad': 39},
 {'_id': 1, 'hola': 'hasta luego', 'altura': 0.39, 'que te pashhhahahha': 45}]

In [52]:
# actualizar

colec.update_one({'_id': 1}, {'$set': {'id': 8953}})

In [53]:
list(colec.find())

[{'_id': ObjectId('653a1e9247a460b952558b97'),
  'nombre': 'Pepe',
  'edad': 45,
  '4': [1, 2, 3, 4, 5]},
 {'_id': 0, 'hola': 'hasta luego', 'altura': 0.39, 'que te pashhhahahha': 45},
 {'_id': 1,
  'hola': 'hasta luego',
  'altura': 0.39,
  'que te pashhhahahha': 45,
  'id': 8953},
 {'_id': 3, 'hola': 'hasta luego', 'altura': 0.39, 'que te pashhhahahha': 45},
 {'_id': ObjectId('653a1f5c47a460b952558b98'), 'nombre': 'yo', 'edad': 39},
 {'_id': 90, 'actividad': 'montaña', 'monte': 'jultayu'}]

In [56]:
colec.update_many({'altura': 0.39}, {'$set': {'nombre': 'Ford Farlaine'}})

In [57]:
list(colec.find())

[{'_id': ObjectId('653a1e9247a460b952558b97'),
  'nombre': 'Pepe',
  'edad': 45,
  '4': [1, 2, 3, 4, 5]},
 {'_id': 0,
  'hola': 'hasta luego',
  'altura': 0.39,
  'que te pashhhahahha': 45,
  'nombre': 'Ford Farlaine'},
 {'_id': 1,
  'hola': 'hasta luego',
  'altura': 0.39,
  'que te pashhhahahha': 45,
  'id': 8953,
  'nombre': 'Ford Farlaine'},
 {'_id': 3,
  'hola': 'hasta luego',
  'altura': 0.39,
  'que te pashhhahahha': 45,
  'nombre': 'Ford Farlaine'},
 {'_id': ObjectId('653a1f5c47a460b952558b98'), 'nombre': 'yo', 'edad': 39},
 {'_id': 90, 'actividad': 'montaña', 'monte': 'jultayu'}]

In [59]:
#colec.insert_one({'_id': 0, 'hola': 4})

In [66]:
# select nombre, edad from colec where edad=39;


query = {'edad': 39}


select = {'_id':False, 'edad': 1}  # 0 es que no venga, 1 es que venga, es para columnas


list(colec.find(query, select))

[{'edad': 39}]

In [67]:
# delete from colec where _id=0;


colec.delete_one({'_id': 0})

In [68]:
list(colec.find())

[{'_id': ObjectId('653a1e9247a460b952558b97'),
  'nombre': 'Pepe',
  'edad': 45,
  '4': [1, 2, 3, 4, 5]},
 {'_id': 1,
  'hola': 'hasta luego',
  'altura': 0.39,
  'que te pashhhahahha': 45,
  'id': 8953,
  'nombre': 'Ford Farlaine'},
 {'_id': 3,
  'hola': 'hasta luego',
  'altura': 0.39,
  'que te pashhhahahha': 45,
  'nombre': 'Ford Farlaine'},
 {'_id': ObjectId('653a1f5c47a460b952558b98'), 'nombre': 'yo', 'edad': 39},
 {'_id': 90, 'actividad': 'montaña', 'monte': 'jultayu'}]

In [69]:
# delete from colec where nombre=yo;

colec.delete_one({'nombre': 'yo'})

In [70]:
list(colec.find({'nombre': 'yo'}))

[]

In [71]:
# select count(*) from colec group by _id;     #por cada id suma 1

list(colec.aggregate([{'$group': {'_id': '', 
                                  'count': {'$sum': 
                                            1}}}]))

[{'_id': '', 'count': 4}]

In [72]:
colec.drop()

In [73]:
db.list_collection_names()

['colec2']

In [75]:
n_colec.drop()

db.list_collection_names()

[]

In [76]:
cursor.list_database_names()

['admin', 'comp', 'companies', 'config', 'ironcomes', 'local', 'quizzes']

### DB Companies

In [77]:
cursor

MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True)

In [78]:
db = cursor.companies

In [79]:
colec = db.coleccion

In [82]:
res = colec.find().limit(1)

list(res)[0].keys()

dict_keys(['_id', 'name', 'permalink', 'crunchbase_url', 'homepage_url', 'blog_url', 'blog_feed_url', 'twitter_username', 'category_code', 'number_of_employees', 'founded_year', 'founded_month', 'founded_day', 'deadpooled_year', 'tag_list', 'alias_list', 'email_address', 'phone_number', 'description', 'created_at', 'updated_at', 'overview', 'image', 'products', 'relationships', 'competitions', 'providerships', 'total_money_raised', 'funding_rounds', 'investments', 'acquisition', 'acquisitions', 'offices', 'milestones', 'video_embeds', 'screenshots', 'external_links', 'partners'])

In [83]:
# select name, category_code from colec 
# where category_code in ('web', 'ecommerce') limit 10;



# por "filas", dame los registros con estos category_code

query = {'$or': [{'category_code': 'web'},
                 {'category_code': 'ecommerce'}]}


# por columnas, dame solo las dos columnas
select={'name': True, 'category_code': True, '_id': False}


res = colec.find(query, select).limit(10)

list(res)

[{'name': 'Wetpaint', 'category_code': 'web'},
 {'name': 'Postini', 'category_code': 'web'},
 {'name': 'Geni', 'category_code': 'web'},
 {'name': 'Fox Interactive Media', 'category_code': 'web'},
 {'name': 'StumbleUpon', 'category_code': 'web'},
 {'name': 'Gizmoz', 'category_code': 'web'},
 {'name': 'eBay', 'category_code': 'web'},
 {'name': 'Viacom', 'category_code': 'web'},
 {'name': 'Plaxo', 'category_code': 'web'},
 {'name': 'Yahoo!', 'category_code': 'web'}]

In [90]:
# select founded_year, name 
# from colec where category_code=web and founded_year<=2002 limit 10;


# por "filas", dame los registros con estos category_code

query = {'$and': [{'category_code': 'web'},
                  {'founded_year': {'$lte': 2002}},
                  {'founded_year': {'$gte': 2000}}]}


# por columnas, dame solo las dos columnas
select={'name': 1, 'founded_year': 1, '_id': 0}


res = list(colec.find(query, select).limit(10))

res

[{'name': 'StumbleUpon', 'founded_year': 2002},
 {'name': 'Plaxo', 'founded_year': 2002},
 {'name': 'Meetup', 'founded_year': 2002},
 {'name': 'Topix', 'founded_year': 2002},
 {'name': 'Steorn', 'founded_year': 2000},
 {'name': 'TechnologyGuide', 'founded_year': 2001},
 {'name': 'Cerado', 'founded_year': 2002},
 {'name': 'Sulake', 'founded_year': 2000},
 {'name': 'SuicideGirls', 'founded_year': 2001},
 {'name': 'BitPass', 'founded_year': 2002}]

In [91]:
df = pd.DataFrame(res)

df

              name  founded_year
0      StumbleUpon          2002
1            Plaxo          2002
2           Meetup          2002
3            Topix          2002
4           Steorn          2000
5  TechnologyGuide          2001
6           Cerado          2002
7           Sulake          2000
8     SuicideGirls          2001
9          BitPass          2002

In [92]:
# select name, category_code, founded_year 
# from colec where name in ('WeGame', 'Facebook');

query = {'name': {'$in': ['WeGame', 'Facebook']}}


select={'name': 1, 'founded_year': 1, '_id': 0}


res = list(colec.find(query, select).limit(10))

res

[{'name': 'Facebook', 'founded_year': 2004},
 {'name': 'WeGame', 'founded_year': 1840}]

In [97]:
# select name, category_code, founded_year 
# from colec where name like 'Face%'; 


query = {'name': {'$regex': '^[Ff]ace'}}

# por columnas, dame solo lass dos columnas
filtro={'name': True, 'founded_year': True, 'category_code': True, '_id': False}



list(colec.find(query, filtro).limit(10))

[{'name': 'Facebook', 'category_code': 'social', 'founded_year': 2004},
 {'name': 'FaceTec', 'category_code': 'software', 'founded_year': 2002},
 {'name': 'Face Your Manga', 'category_code': 'web', 'founded_year': None},
 {'name': 'Facebookster',
  'category_code': 'public_relations',
  'founded_year': 2003},
 {'name': 'Facebook Causes Application',
  'category_code': None,
  'founded_year': None},
 {'name': 'FaceKoo', 'category_code': 'network_hosting', 'founded_year': 2008},
 {'name': 'facetime', 'category_code': None, 'founded_year': None},
 {'name': 'facelovefinder', 'category_code': 'web', 'founded_year': 2009},
 {'name': 'FacebookLicious!',
  'category_code': 'games_video',
  'founded_year': 2007},
 {'name': 'FaceTime Strategy',
  'category_code': 'public_relations',
  'founded_year': None}]

### Geoqueries

In [98]:
# documentos que contengan oficinas, devuelve solo el nombre y el array de oficinas

query={'offices': {'$not': {'$size': 0}}}

filtro={'_id': 0, 'name': 1, 'offices': 1}

ofi=colec.find(query, filtro)

In [99]:
df = pd.DataFrame(ofi)


df=df.dropna()


df.head()

        name                                            offices
0   Wetpaint  [{'description': '', 'address1': '710 - 2nd Av...
1  AdventNet  [{'description': 'Headquarters', 'address1': '...
2       Zoho  [{'description': 'Headquarters', 'address1': '...
3       Digg  [{'description': None, 'address1': '135 Missis...
4   Facebook  [{'description': 'Headquarters', 'address1': '...

In [100]:
df.offices[0]

[{'description': '',
  'address1': '710 - 2nd Avenue',
  'address2': 'Suite 1100',
  'zip_code': '98104',
  'city': 'Seattle',
  'state_code': 'WA',
  'country_code': 'USA',
  'latitude': 47.603122,
  'longitude': -122.333253},
 {'description': '',
  'address1': '270 Lafayette Street',
  'address2': 'Suite 505',
  'zip_code': '10012',
  'city': 'New York',
  'state_code': 'NY',
  'country_code': 'USA',
  'latitude': 40.7237306,
  'longitude': -73.9964312}]

In [101]:
# extraer la primera oficina y crear geopunto


def get_first(data):
    
    data=data.offices
    
    principal=None
    
    
    if data[0]['latitude'] and data[0]['longitude']:
        
        principal = {'type': 'Point',
                     'coordinates': [data[0]['longitude'],
                                     data[0]['latitude']]}
        
        
    return {'total_offices': len(data),
            'lat': data[0]['latitude'],
            'lng': data[0]['longitude'],
            'principal': principal}

In [102]:
first_office = df[['offices']].apply(get_first, result_type='expand', axis=1)

first_office.head()

,total_offices,lat,lng,principal
0,2.0,47.603122,-122.333253,"{'type': 'Point', 'coordinates': [-122.333253,..."
1,1.0,37.692934,-121.904945,"{'type': 'Point', 'coordinates': [-121.904945,..."
2,1.0,37.692934,-121.904945,"{'type': 'Point', 'coordinates': [-121.904945,..."
3,1.0,37.764726,-122.394523,"{'type': 'Point', 'coordinates': [-122.394523,..."
4,3.0,37.416050,-122.151801,"{'type': 'Point', 'coordinates': [-122.151801,..."

In [104]:
df.name[:5]

0     Wetpaint
1    AdventNet
2         Zoho
3         Digg
4     Facebook
Name: name, dtype: object

In [105]:
first_office['name']=df.name

first_office.head()

,total_offices,lat,lng,principal,name
0,2.0,47.603122,-122.333253,"{'type': 'Point', 'coordinates': [-122.333253,...",Wetpaint
1,1.0,37.692934,-121.904945,"{'type': 'Point', 'coordinates': [-121.904945,...",AdventNet
2,1.0,37.692934,-121.904945,"{'type': 'Point', 'coordinates': [-121.904945,...",Zoho
3,1.0,37.764726,-122.394523,"{'type': 'Point', 'coordinates': [-122.394523,...",Digg
4,3.0,37.416050,-122.151801,"{'type': 'Point', 'coordinates': [-122.151801,...",Facebook

In [106]:
df = first_office.copy()

df = df.dropna()

In [108]:
#df.to_json('../data/oficinas.json')  # para compass

In [110]:
db.first_office.insert_many(df.to_dict('records'))

In [111]:
db.first_office.create_index([('principal', '2dsphere')])  # sobre la coleccion

'principal_2dsphere'

In [113]:
def find_near(array, radio=1000):

    query={'principal': {'$near': {'$geometry': {'type': 'Point',
                                                 'coordinates': array},

                                  '$maxDistance': radio}}}
    
    return db.first_office.find(query)

In [114]:
park_avenue=[-73.987308, 40.738935]

In [115]:
find_near(park_avenue)

In [116]:
df=pd.DataFrame(find_near(park_avenue))

df.head()

,_id,total_offices,lat,lng,principal,name
0,653a28ee47a460b95255a94f,1.0,40.738567,-73.987199,"{'type': 'Point', 'coordinates': [-73.987199, ...",SpaBooker
1,653a28ee47a460b952559727,1.0,40.739341,-73.988357,"{'type': 'Point', 'coordinates': [-73.988357, ...",HealthiNation
2,653a28ee47a460b95255930f,1.0,40.737721,-73.987725,"{'type': 'Point', 'coordinates': [-73.987725, ...",Special Ops Media
3,653a28ee47a460b95255afa1,1.0,40.740154,-73.986742,"{'type': 'Point', 'coordinates': [-73.9867417,...",Mashable
4,653a28ee47a460b95255a0a6,1.0,40.740207,-73.987002,"{'type': 'Point', 'coordinates': [-73.987002, ...",Return Path